# Jacob Sheehan
## Week 13 11/14/2024
### Python - Pandas DataFrame - Mapping, Applying, Grouping, Plotting

In [3]:
import numpy as np
from pandas import *
import pandas as pd

In [4]:
df = DataFrame({'city':['Alma', 'Brian Head', 'Fox Park', 'Lake Mary'],
                   'altitude':[10355,9800,9062,8966]})
df

         city  altitude
0        Alma     10355
1  Brian Head      9800
2    Fox Park      9062
3   Lake Mary      8966

In [5]:
st_map = {'Alma':'Colorado','Brian Head':'Utah','Fox Park':'Wyoming',
             'Lake Mary': 'California'}
st_map

{'Alma': 'Colorado',
 'Brian Head': 'Utah',
 'Fox Park': 'Wyoming',
 'Lake Mary': 'California'}

In [6]:
#map()
df['State'] = df['city'].map(st_map)
df

         city  altitude       State
0        Alma     10355    Colorado
1  Brian Head      9800        Utah
2    Fox Park      9062     Wyoming
3   Lake Mary      8966  California

In [7]:
#apply
df1 = df.copy()
def meter(x):
    return x / 3.2808

In [8]:
df['altitude'] = df['altitude'].apply(meter)
df

         city     altitude       State
0        Alma  3156.242380    Colorado
1  Brian Head  2987.076323        Utah
2    Fox Park  2762.131188     Wyoming
3   Lake Mary  2732.870032  California

In [9]:
df1['altitude'] = df1['altitude'].apply(lambda x: x / 3.2808)
df1

         city     altitude       State
0        Alma  3156.242380    Colorado
1  Brian Head  2987.076323        Utah
2    Fox Park  2762.131188     Wyoming
3   Lake Mary  2732.870032  California

In [10]:
df['altitude'] = df['altitude'].apply(lambda x: np.nan if x < 2800 else x)
df

         city     altitude       State
0        Alma  3156.242380    Colorado
1  Brian Head  2987.076323        Utah
2    Fox Park          NaN     Wyoming
3   Lake Mary          NaN  California